Revit 2027 API
BuiltInFailures.ConnectorFailures.ElementsConnectedToParent Property
 You have selected elements that are connected to a parent object in a System. These elements cannot be removed from the System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsConnectedToParent { get; }
Public Shared ReadOnly Property ElementsConnectedToParent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsConnectedToParent {
	FailureDefinitionId^ get ();
}
static member ElementsConnectedToParent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace